export const projectTHeads = [
  {
    id: 1,
    label: '#',
  },
  {
    id: 2,
    label: 'نام کارفرما',
  },
  {
    id: 3,
    label: 'موضوع',
  },
  {
    id: 4,
    label: 'محل اجرا',
  },
  {
    id: 5,
    label: 'شرح کالا های تامین شده',
  },
];
export interface ProjectItem {
  id: string;
  employer: string;
  subject: string;
  location: string;
  suppliedItems: string[];
}

export const projectsItems: ProjectItem[] = [
  {
    id: '01',
    employer: 'مجتمع معدنی و صنعتی سنگ آهن چادرملو',
    subject: 'تامین تجهیزات پروژه احداث کارخانه فولاد سازی',
    location: 'یزد',
    suppliedItems: [
      'الکتروپمپ',
      'لوله و اتصالات',
      'شیرآلات',
      'فیلترهای کارتریجی',
      'تجهیزات ابزاردقیق',
    ],
  },
  {
    id: '02',
    employer: 'مجتمع جهان فولاد سیرجان',
    subject:
      'طراحی، ساخت و اجرای مخزن بتنی 10000 مترمکعبی، سوله تصفیه خانه و ایستگاه پمپاژ به صورت EPC',
    location: 'سیرجان گل گهر',
    suppliedItems: [
      'پمپ‌های دوزینگ، بک‌واش و فشار قوی',
      'میکسرها',
      'بلوئرها',
      'لوله، اتصالات و شیرآلات',
      'انواع مخازن تحت فشار و دوزینگ',
    ],
  },
  {
    id: '03',
    employer: 'فولاد غرب آسیا',
    subject: 'تامین تجهیزات پروژه تصفیه آب رودخانه قمرود جهت استحصال آب صنعتی',
    location: 'قم',
    suppliedItems: [
      'الکتروپمپ',
      'لوله و اتصالات',
      'شیرآلات',
      'انواع فیلتر',
      'ممبران',
      'تجهیزات ابزاردقیق',
    ],
  },
  {
    id: '04',
    employer: 'فولاد غرب آسیا',
    subject: 'تامین تجهیزات جهت کارخانه نورد',
    location: 'قم',
    suppliedItems: ['غلطک', 'الکتروموتور', 'گیربکس'],
  },
  {
    id: '05',
    employer: 'آسفالت طوس',
    subject: 'تامین تجهیزات پروژه تصفیه آب چاه با TDS=15000 ppm',
    location: 'سیرجان گل گهر',
    suppliedItems: ['الکتروپمپ', 'انواع فیلتر', 'لوله و اتصالات', 'شیرآلات'],
  },
  {
    id: '06',
    employer: 'پتروشیمی آبادان',
    subject: 'تامین لوازم یدکی',
    location: 'آبادان',
    suppliedItems: ['الکتروپمپ', 'لوله و اتصالات', 'شیرآلات', 'انواع فیلتر', 'تجهیزات ابزاردقیق'],
  },
  {
    id: '07',
    employer: 'شرکت ملی گاز ایران',
    subject: 'تصفیه و تامین آب شرب مجتمع',
    location: 'دلیجان',
    suppliedItems: ['الکتروپمپ', 'لوله و اتصالات', 'شیرآلات', 'فیلتر'],
  },
  {
    id: '08',
    employer: 'توسعه سازه‌های دریایی – تسدید',
    subject: 'تصفیه پساب انسانی به ظرفیت 50 مترمکعب در شبانه‌روز',
    location: 'خرمشهر',
    suppliedItems: ['لوله', 'شیرآلات', 'ابزاردقیق'],
  },
  {
    id: '09',
    employer: 'شرکت آرین شیمی',
    subject: 'تصفیه آب چاه و تولید آب صنعتی جهت مصرف فرآیندی',
    location: 'سلفچگان',
    suppliedItems: ['الکتروپمپ', 'لوله و اتصالات', 'شیرآلات', 'فیلتر'],
  },
  {
    id: '10',
    employer: 'شرکت کیسون',
    subject:
      'تصفیه پساب انسانی کمپ مسکونی جهت استفاده در فضای سبز به ظرفیت 30 مترمکعب در شبانه‌روز',
    location: 'عسلویه',
    suppliedItems: ['الکتروپمپ', 'لوله و اتصالات', 'شیرآلات', 'فیلتر', 'ممبران', 'مواد شیمیایی'],
  },
  {
    id: '11',
    employer: 'آب و فاضلاب شهری یزد',
    subject: 'تصفیه پساب بهداشتی مسکن بهزیستی شهر میبد',
    location: 'میبد',
    suppliedItems: ['الکتروپمپ', 'لوله و اتصالات', 'شیرآلات', 'مواد شیمیایی', 'فیلتر'],
  },
  {
    id: '12',
    employer: 'فراساحل قشم',
    subject: 'تصفیه و شیرین‌سازی آب دریا جهت تامین آب بهداشتی و شرب',
    location: 'قشم',
    suppliedItems: ['لوله'],
  },
  {
    id: '13',
    employer: 'شرکت خدمات فولاد ایران',
    subject: 'تصفیه آب چاه و تامین آب صنعتی',
    location: 'شورآباد تهران',
    suppliedItems: ['الکتروموتور', 'درایو'],
  },
  {
    id: '14',
    employer: 'پالایشگاه پنجم پارس جنوبی',
    subject: 'تامین لوازم یدکی',
    location: 'عسلویه',
    suppliedItems: ['ترانسمیتر فشار', 'ترانسمیتر دما'],
  },
];
